
<!DOCTYPE HTML>
<html lang="" >
    <head>
        <meta charset="UTF-8">
        <meta content="text/html; charset=utf-8" http-equiv="Content-Type">
        <title>1.3.6 服务管理 · GitBook</title>
        <meta http-equiv="X-UA-Compatible" content="IE=edge" />
        <meta name="description" content="">
        <meta name="generator" content="GitBook 3.2.3">
        
        
        
    
    <link rel="stylesheet" href="../gitbook/style.css">

    
            
                
                <link rel="stylesheet" href="../gitbook/gitbook-plugin-highlight/website.css">
                
            
                
                <link rel="stylesheet" href="../gitbook/gitbook-plugin-search/search.css">
                
            
                
                <link rel="stylesheet" href="../gitbook/gitbook-plugin-fontsettings/website.css">
                
            
        

    

    
        
    
        
    
        
    
        
    
        
    
        
    

        
    
    
    <meta name="HandheldFriendly" content="true"/>
    <meta name="viewport" content="width=device-width, initial-scale=1, user-scalable=no">
    <meta name="apple-mobile-web-app-capable" content="yes">
    <meta name="apple-mobile-web-app-status-bar-style" content="black">
    <link rel="apple-touch-icon-precomposed" sizes="152x152" href="../gitbook/images/apple-touch-icon-precomposed-152.png">
    <link rel="shortcut icon" href="../gitbook/images/favicon.ico" type="image/x-icon">

    
    <link rel="next" href="config.html" />
    
    
    <link rel="prev" href="project.html" />
    

    </head>
    <body>
        
<div class="book">
    <div class="book-summary">
        
            
<div id="book-search-input" role="search">
    <input type="text" placeholder="Type to search" />
</div>

            
                <nav role="navigation">
                


<ul class="summary">
    
    

    

    
        
        
    
        <li class="chapter " data-level="1.1" data-path="../">
            
                <a href="../">
            
                    
                    1.1 前言
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.2" data-path="../introduction.html">
            
                <a href="../introduction.html">
            
                    
                    1.2 体系结构
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.3" data-path="../function.html">
            
                <a href="../function.html">
            
                    
                    1.3 功能介绍
            
                </a>
            

            
            <ul class="articles">
                
    
        <li class="chapter " data-level="1.3.1" data-path="system.html">
            
                <a href="system.html">
            
                    
                    1.3.1 系统信息
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.3.2" data-path="upms.html">
            
                <a href="upms.html">
            
                    
                    1.3.2 用户管理
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.3.3" data-path="resource.html">
            
                <a href="resource.html">
            
                    
                    1.3.3 资源管理
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.3.4" data-path="env.html">
            
                <a href="env.html">
            
                    
                    1.3.4 环境管理
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.3.5" data-path="project.html">
            
                <a href="project.html">
            
                    
                    1.3.5 项目管理
            
                </a>
            

            
        </li>
    
        <li class="chapter active" data-level="1.3.6" data-path="service.html">
            
                <a href="service.html">
            
                    
                    1.3.6 服务管理
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.3.7" data-path="config.html">
            
                <a href="config.html">
            
                    
                    1.3.7 发布配置
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.3.8" data-path="deploy.html">
            
                <a href="deploy.html">
            
                    
                    1.3.8 服务发布
            
                </a>
            

            
        </li>
    

            </ul>
            
        </li>
    
        <li class="chapter " data-level="1.4" data-path="../version.html">
            
                <a href="../version.html">
            
                    
                    1.4 版本预热
            
                </a>
            

            
            <ul class="articles">
                
    
        <li class="chapter " data-level="1.4.1" data-path="../version/ata-cloud 2.0.html">
            
                <a href="../version/ata-cloud 2.0.html">
            
                    
                    1.4.1 ata-cloud 2.0
            
                </a>
            

            
        </li>
    

            </ul>
            
        </li>
    
        <li class="chapter " data-level="1.5" data-path="../epilog.html">
            
                <a href="../epilog.html">
            
                    
                    1.5 结语
            
                </a>
            

            
        </li>
    

    

    <li class="divider"></li>

    <li>
        <a href="https://www.gitbook.com" target="blank" class="gitbook-link">
            Published with GitBook
        </a>
    </li>
</ul>


                </nav>
            
        
    </div>

    <div class="book-body">
        
            <div class="body-inner">
                
                    

<div class="book-header" role="navigation">
    

    <!-- Title -->
    <h1>
        <i class="fa fa-circle-o-notch fa-spin"></i>
        <a href=".." >1.3.6 服务管理</a>
    </h1>
</div>




                    <div class="page-wrapper" tabindex="-1" role="main">
                        <div class="page-inner">
                            
<div id="book-search-results">
    <div class="search-noresults">
    
                                <section class="normal markdown-section">
                                
                                <h3 id="&#x670D;&#x52A1;&#x7BA1;&#x7406;">&#x670D;&#x52A1;&#x7BA1;&#x7406;</h3>
<h4 id="&#x670D;&#x52A1;&#x5217;&#x8868;">&#x670D;&#x52A1;&#x5217;&#x8868;</h4>
<p><img src="../assets/&#x670D;&#x52A1;-&#x670D;&#x52A1;&#x5217;&#x8868;.png" alt=""></p>
<ul>
<li><strong>&#x6392;&#x5E8F;&#xFF1A;</strong> &#x670D;&#x52A1;&#x5217;&#x8868;&#x7684;&#x5361;&#x7247;&#x5148;&#x6309;&#x7167;&#x9879;&#x76EE;&#x6392;&#x5E8F;&#xFF0C;&#x540C;&#x4E00;&#x4E2A;&#x9879;&#x76EE;&#x91CC;&#x7684;&#x670D;&#x52A1;&#x518D;&#x6839;&#x636E;&#x540D;&#x79F0;&#x6392;&#x5E8F;&#x3002;</li>
<li><strong>&#x7F6E;&#x9876;&#xFF1A;</strong> &#x7528;&#x6237;&#x53EF;&#x4EE5;&#x81EA;&#x884C;&#x5BF9;&#x670D;&#x52A1;&#x8FDB;&#x884C;&#x7F6E;&#x9876;&#x64CD;&#x4F5C;&#xFF0C;&#x4EC5;&#x5BF9;&#x81EA;&#x5DF1;&#x6709;&#x6548;&#x3002;</li>
<li><strong>&#x641C;&#x7D22;&#xFF1A;</strong> &#x670D;&#x52A1;&#x5217;&#x8868;&#x53EF;&#x8F93;&#x5165;&#x5173;&#x952E;&#x5B57;&#x8FDB;&#x884C;&#x8FC7;&#x6EE4;&#xFF0C;&#x4F1A;&#x5339;&#x914D;&#x670D;&#x52A1;&#x540D;&#x79F0;&#x3001;&#x670D;&#x52A1;CODE&#x548C;&#x670D;&#x52A1;&#x63CF;&#x8FF0;&#x3002;</li>
</ul>
<h4 id="&#x65B0;&#x5EFA;&#x670D;&#x52A1;">&#x65B0;&#x5EFA;&#x670D;&#x52A1;</h4>
<p>&#x5982;&#x679C;&#x670D;&#x52A1;&#x6CA1;&#x6709;&#x521B;&#x5EFA;&#x4EE3;&#x7801;&#x5E93;&#xFF0C;&#x53EF;&#x9009;&quot;OPS&#x6258;&#x7BA1;Gitlab&quot;&#x81EA;&#x52A8;&#x521B;&#x5EFA;&#x670D;&#x52A1;&#x4EE3;&#x7801;&#x5E93;&#xFF1B;&#x5982;&#x679C;&#x670D;&#x52A1;&#x5DF2;&#x6709;&#x4EE3;&#x7801;&#x5E93;&#x4EA6;&#x53EF;&#x9009;&#x62E9;&quot;&#x81EA;&#x5B9A;&#x4E49;git&#x4EE3;&#x7801;&#x4ED3;&#x5E93;&quot;&#x76F4;&#x63A5;&#x5173;&#x8054;&#x5DF2;&#x6709;&#x4EE3;&#x7801;&#x5E93;&#xFF08;&#x9700;&#x8981;&#x914D;&#x7F6E;&#x4EE3;&#x7801;&#x5E93;&#x7684;&#x8BBF;&#x95EE;&#x51ED;&#x8BC1;&#xFF09;&#x3002;</p>
<p><img src="../assets/&#x670D;&#x52A1;-&#x65B0;&#x5EFA;&#x670D;&#x52A1;&#x65B9;&#x5F0F;.png" alt=""></p>
<ul>
<li><h6 id="1&#x3001;ops&#x6258;&#x7BA1;gitlab">1&#x3001;OPS&#x6258;&#x7BA1;Gitlab</h6>
</li>
</ul>
<p>OPS&#x5B89;&#x88C5;&#x65F6;&#x9644;&#x5E26;&#x5B89;&#x88C5;&#x7684;&#x6258;&#x7BA1;Gitlab&#xFF0C;OPS&#x5C06;&#x81EA;&#x52A8;&#x7BA1;&#x7406;&#x6B64;Gitlab&#xFF0C;&#x81EA;&#x52A8;&#x521B;&#x5EFA;&#x548C;&#x7BA1;&#x7406;&#x9879;&#x76EE;&#x548C;&#x670D;&#x52A1;&#xFF0C;&#x62C9;&#x53D6;&#x4EE3;&#x7801;&#x65F6;&#x4F7F;&#x7528;token&#xFF0C;&#x4E0D;&#x9700;&#x8981;&#x989D;&#x5916;&#x8BBE;&#x7F6E;&#x51ED;&#x636E;&#x3002;
<br>
&#x81EA;&#x52A8;&#x4E3A;&#x670D;&#x52A1;&#x521B;&#x5EFA;&#x4EE3;&#x7801;&#x5E93;&#xFF0C;&#x4EE3;&#x7801;&#x5E93;&#x7684;&#x540D;&#x79F0;&#x4E3A;&#x8868;&#x5355;&#x4E2D;&#x6240;&#x586B;&#x5199;&#x7684;&quot;&#x670D;&#x52A1;CODE&quot;&#xFF0C;&#x4EE3;&#x7801;&#x5E93;&#x6240;&#x5C5E;&#x7EC4;&#x4E3A;&#x670D;&#x52A1;&#x6240;&#x5C5E;&#x9879;&#x76EE;&#x7684;&#x5206;&#x7EC4;&#x3002;
&#x9700;&#x8981;&#x586B;&#x5199;&#x7684;&#x4FE1;&#x606F;&#x5982;&#x4E0B;&#x56FE;&#x6240;&#x793A;&#xFF1A;
<img src="../assets/&#x670D;&#x52A1;-&#x4ECE;ops&#x6258;&#x7BA1;gitlab&#x65B0;&#x5EFA;.png" alt=""></p>
<ul>
<li><h6 id="2&#x3001;&#x81EA;&#x5B9A;&#x4E49;git&#x4EE3;&#x7801;&#x4ED3;&#x5E93;">2&#x3001;&#x81EA;&#x5B9A;&#x4E49;git&#x4EE3;&#x7801;&#x4ED3;&#x5E93;</h6>
&#x4F7F;&#x7528;&#x5916;&#x90E8;&#x7684;&#x4EE3;&#x7801;&#x4ED3;&#x5E93;&#xFF08;&#x975E;OPS&#x6258;&#x7BA1;Gitlab&#xFF09;&#xFF0C;&#x5982;&#x679C;&#x670D;&#x52A1;&#x5DF2;&#x6709;&#x4EE3;&#x7801;&#x5E93;&#x53EF;&#x9009;&#x6B64;&#x7C7B;&#x578B;&#x8FDB;&#x884C;&#x670D;&#x52A1;&#x521B;&#x5EFA;&#x3002;&#x9700;&#x8981;&#x63D0;&#x4F9B;&#x6B64;&#x670D;&#x52A1;&#x5BF9;&#x5E94;&#x7684;&#x5B8C;&#x6574;&#x4EE3;&#x7801;&#x4ED3;&#x5E93;&#x5730;&#x5740;&#x548C;&#x76F8;&#x5E94;&#x7684;&#x51ED;&#x636E;&#x3002;
<br>
&#x4E0E;&#x9009;&#x62E9;&quot;OPS&#x6258;&#x7BA1;&#x4EE3;&#x7801;&#x5E93;&quot;&#x7684;&#x533A;&#x522B;&#x5728;&#x4E8E;&#x9700;&#x8981;&#x8BBE;&#x7F6E;&#x4EE3;&#x7801;&#x5E93;&#x7684;&#x5730;&#x5740;&#x5E76;&#x914D;&#x7F6E;&#x4EE3;&#x7801;&#x5E93;&#x7684;&#x8BBF;&#x95EE;&#x51ED;&#x8BC1;&#x3002;
&#x586B;&#x5199;&#x8868;&#x5355;&#x540E;&#x63D0;&#x4EA4;&#x8868;&#x5355;&#xFF0C;&#x901A;&#x8FC7;&#x9A8C;&#x8BC1;&#x540E;&#x5373;&#x53EF;&#x5B8C;&#x6210;&#x670D;&#x52A1;&#x521B;&#x5EFA;&#x3002;
&#x9700;&#x8981;&#x586B;&#x5199;&#x7684;&#x4FE1;&#x606F;&#x5982;&#x4E0B;&#x56FE;&#x6240;&#x793A;&#xFF1A;
<img src="../assets/&#x670D;&#x52A1;-&#x4ECE;&#x5916;&#x90E8;git&#x4EE3;&#x7801;&#x4ED3;&#x5E93;&#x65B0;&#x5EFA;.png" alt=""></li>
</ul>
<h4 id="&#x670D;&#x52A1;&#x8BE6;&#x60C5;">&#x670D;&#x52A1;&#x8BE6;&#x60C5;</h4>
<p>&#x70B9;&#x51FB;&#x67D0;&#x4E00;&#x670D;&#x52A1;&#x5361;&#x7247;&#x8FDB;&#x5165;&#x670D;&#x52A1;&#x8BE6;&#x60C5;&#xFF0C;&#x670D;&#x52A1;&#x8BE6;&#x60C5;&#x7684;&#x5B50;&#x7279;&#x6027;&#x5305;&#x62EC;&#x670D;&#x52A1;&#x6982;&#x89C8;&#x3001;&#x6784;&#x5EFA;&#x53D1;&#x5E03;&#x3001;&#x8FD0;&#x884C;&#x60C5;&#x51B5;&#x3001;&#x5207;&#x6362;&#x73AF;&#x5883;&#x3001;&#x670D;&#x52A1;&#x914D;&#x7F6E;&#xFF08;&#x53F3;&#x4E0A;&#x89D2;&#x5C0F;&#x6273;&#x624B;&#x56FE;&#x6807;&#xFF09;&#x3001;&#x955C;&#x50CF;&#x7BA1;&#x7406;&#xFF08;&#x53F3;&#x4E0A;&#x89D2;&#x4E09;&#x4E2A;&#x70B9;&#xB7;&#xB7;&#xB7;&#xFF09;
<img src="../assets/&#x670D;&#x52A1;-&#x670D;&#x52A1;&#x8BE6;&#x60C5;.png" alt=""></p>
<h4 id="&#x670D;&#x52A1;&#x6982;&#x89C8;">&#x670D;&#x52A1;&#x6982;&#x89C8;</h4>
<p>&#x670D;&#x52A1;&#x6982;&#x89C8;&#x7684;&#x5B50;&#x7279;&#x6027;&#x5206;&#x4E3A;&#x670D;&#x52A1;&#x72B6;&#x6001;&#x3001;&#x8D44;&#x6E90;&#x4F7F;&#x7528;&#x60C5;&#x51B5;&#x3001;&#x8FD0;&#x884C;&#x73AF;&#x5883;&#x3001;&#x64CD;&#x4F5C;&#x65E5;&#x5FD7;&#x3002;</p>
<ul>
<li><strong>&#x8FD0;&#x884C;&#x72B6;&#x6001;&#xFF1A;</strong> &#x670D;&#x52A1;&#x5F53;&#x524D;&#x73AF;&#x5883;&#x7684;&#x8FD0;&#x884C;&#x72B6;&#x6001;&#x3002;</li>
<li><strong>&#x8D44;&#x6E90;&#x4F7F;&#x7528;&#xFF1A;</strong> &#x670D;&#x52A1;&#x5F53;&#x524D;&#x73AF;&#x5883;&#x4F7F;&#x7528;&#x7684;&#x8D44;&#x6E90;&#x3002;</li>
<li><strong>&#x8FD0;&#x884C;&#x73AF;&#x5883;&#xFF1A;</strong> &#x670D;&#x52A1;&#x7684;&#x4EE3;&#x7801;&#x5E93;&#x5730;&#x5740;&#x3001;&#x6240;&#x5C5E;&#x9879;&#x76EE;&#x3001;&#x73AF;&#x5883;&#x3001;&#x96C6;&#x7FA4;&#x4FE1;&#x606F;&#x3002;</li>
<li><strong>&#x64CD;&#x4F5C;&#x65E5;&#x5FD7;&#xFF1A;</strong> &#x8BB0;&#x5F55;&#x4E86;&#x670D;&#x52A1;&#x5728;&#x5F53;&#x524D;&#x73AF;&#x5883;&#x6240;&#x6709;&#x7684;&#x64CD;&#x4F5C;&#x8BB0;&#x5F55;&#x7EA7;&#x76F8;&#x5173;&#x65E5;&#x5FD7;&#x3002;
<img src="../assets/&#x670D;&#x52A1;-&#x670D;&#x52A1;&#x8BE6;&#x60C5;.png" alt=""></li>
</ul>
<h4 id="&#x6784;&#x5EFA;&#x53D1;&#x5E03;">&#x6784;&#x5EFA;&#x53D1;&#x5E03;</h4>
<p>&#x8BE6;&#x89C1;<a href="deploy.html">&#x670D;&#x52A1;&#x53D1;&#x5E03;</a></p>
<h4 id="&#x8FD0;&#x884C;&#x60C5;&#x51B5;">&#x8FD0;&#x884C;&#x60C5;&#x51B5;</h4>
<p>&#x663E;&#x793A;&#x5DF2;&#x53D1;&#x5E03;&#x7684;&#x670D;&#x52A1;&#x8FD0;&#x884C;&#x60C5;&#x51B5;&#x3002;
<img src="../assets/&#x670D;&#x52A1;-&#x670D;&#x52A1;&#x8FD0;&#x884C;&#x60C5;&#x51B5;.png" alt=""></p>
<ul>
<li><strong>&#x5F53;&#x524D;&#x7248;&#x672C;&#xFF1A;</strong> &#x670D;&#x52A1;&#x6240;&#x4F7F;&#x7528;&#x7684;&#x955C;&#x50CF;&#x7248;&#x672C;&#x4FE1;&#x606F;&#xFF08;&#x955C;&#x50CF;&#x6784;&#x5EFA;&#x65F6;&#x95F4;&#xFF0C;&#x4EE3;&#x7801;&#x63D0;&#x4EA4;&#x8BB0;&#x5F55;&#x7B49;&#xFF09;&#x3002; </li>
<li><strong>&#x8BBF;&#x95EE;&#x5730;&#x5740;&#xFF1A;</strong> &#x670D;&#x52A1;&#x7684;&#x8BBF;&#x95EE;&#x5730;&#x5740;&#x4FE1;&#x606F;&#x3002;</li>
<li><strong>&#x5BB9;&#x5668;&#x5217;&#x8868;&#xFF1A;</strong> &#x670D;&#x52A1;&#x8FD0;&#x884C;&#x7684;&#x5177;&#x4F53;&#x5BB9;&#x5668;&#x5B9E;&#x4F8B;&#x4FE1;&#x606F;&#xFF08;&#x5305;&#x62EC;&#x5BB9;&#x5668;&#x65E5;&#x5FD7;&#x67E5;&#x770B;&#xFF09;&#x3002;</li>
<li><strong>&#x6269;&#x7F29;&#x5BB9;&#xFF1A;</strong> &#x52A8;&#x6001;&#x8C03;&#x6574;&#x670D;&#x52A1;&#x7684;cup&#x3001;&#x5185;&#x5B58;&#x4EE5;&#x53CA;&#x5B9E;&#x4F8B;&#x4E2A;&#x6570;&#x3002;&#x5E03;&#x670D;&#x52A1;&#x7684;&#x8FD0;&#x884C;&#x60C5;&#x51B5;</li>
</ul>
<h4 id="&#x5207;&#x6362;&#x73AF;&#x5883;">&#x5207;&#x6362;&#x73AF;&#x5883;</h4>
<p>&#x9664;&#x670D;&#x52A1;&#x7684;&#x57FA;&#x672C;&#x4FE1;&#x606F;&#x5916;&#xFF0C;&#x5176;&#x4ED6;&#x4FE1;&#x606F;&#x90FD;&#x4E0E;&#x5177;&#x4F53;&#x73AF;&#x5883;&#x6709;&#x5173;&#xFF0C;&#x6240;&#x4EE5;&#x76F8;&#x5173;&#x6570;&#x636E;&#x529F;&#x80FD;&#x90FD;&#x6309;&#x7167;&#x5F53;&#x524D;&#x6240;&#x9009;&#x73AF;&#x5883;&#x8FDB;&#x884C;&#x5C55;&#x793A;&#x548C;&#x64CD;&#x4F5C;&#x3002;
<img src="../assets/&#x670D;&#x52A1;-&#x5207;&#x6362;&#x73AF;&#x5883;.png" alt=""></p>
<h4 id="&#x670D;&#x52A1;&#x914D;&#x7F6E;">&#x670D;&#x52A1;&#x914D;&#x7F6E;</h4>
<p>&#x670D;&#x52A1;&#x8BE6;&#x60C5;&#x5B50;&#x7279;&#x6027;&#x5305;&#x542B;&#x670D;&#x52A1;&#x4FE1;&#x606F;&#x3001;&#x6784;&#x5EFA;&#x53D1;&#x5E03;&#x914D;&#x7F6E;&#x3001;&#x5220;&#x9664;&#x670D;&#x52A1;&#xFF08;&#x7BA1;&#x7406;&#x5458;&#x548C;&#x9879;&#x76EE;&#x8D1F;&#x8D23;&#x4EBA;&#x624D;&#x6709;&#x6B64;&#x6743;&#x9650;&#xFF09;&#x3002;
<img src="../assets/&#x670D;&#x52A1;-&#x670D;&#x52A1;&#x914D;&#x7F6E;.png" alt=""></p>
<ul>
<li><strong>&#x57FA;&#x672C;&#x4FE1;&#x606F;&#xFF1A;</strong> &#x53EF;&#x4FEE;&#x6539;&#x670D;&#x52A1;&#x8D1F;&#x8D23;&#x4EBA;&#x3001;&#x670D;&#x52A1;&#x63CF;&#x8FF0;&#x4FE1;&#x606F;&#xFF0C;&#x670D;&#x52A1;&#x7C7B;&#x578B;&#x4E0D;&#x53EF;&#x53D8;&#x66F4;&#x3002;</li>
<li><strong>&#x53D1;&#x5E03;&#x914D;&#x7F6E;&#xFF1A;</strong> &#x8BE6;&#x89C1;<a href="config.html">&#x53D1;&#x5E03;&#x914D;&#x7F6E;</a></li>
<li><strong>&#x670D;&#x52A1;&#x5220;&#x9664;&#xFF1A;</strong> &#x5220;&#x9664;&#x64CD;&#x4F5C;&#x4E0D;&#x53EF;&#x9006;&#xFF0C;&#x4E14;&#x662F;&#x9488;&#x5BF9;&#x5F53;&#x524D;&#x670D;&#x52A1;&#xFF0C;&#x800C;&#x4E0D;&#x4EC5;&#x662F;&#x670D;&#x52A1;&#x7684;&#x5F53;&#x524D;&#x73AF;&#x5883;&#x3002;</li>
</ul>
<h4 id="&#x955C;&#x50CF;&#x7BA1;&#x7406;">&#x955C;&#x50CF;&#x7BA1;&#x7406;</h4>
<p>&#x6BCF;&#x6B21;&#x6784;&#x5EFA;&#x53D1;&#x5E03;&#x90FD;&#x4F1A;&#x521B;&#x5EFA;&#x51FA;&#x4E00;&#x4E2A;&#x65B0;&#x955C;&#x50CF;&#x3002;</p>
<h5 id="1&#x3001;&#x955C;&#x50CF;&#x4FE1;&#x606F;">1&#x3001;&#x955C;&#x50CF;&#x4FE1;&#x606F;</h5>
<ul>
<li><p>&#x955C;&#x50CF;&#x540D;&#xFF1A;&#x9879;&#x76EE;CODE/&#x670D;&#x52A1;CODE</p>
</li>
<li><p>&#x955C;&#x50CF;tag&#xFF1A;&#x73AF;&#x5883;CODE-&#x4EE3;&#x7801;&#x5206;&#x652F;-&#x6784;&#x5EFA;&#x65F6;&#x95F4;&#xFF08;yyyyMMdd-HHmm&#xFF09;</p>
</li>
<li><p>&#x5173;&#x8054;git&#x63D0;&#x4EA4;&#x8BB0;&#x5F55;&#xFF1A;&#x5728;&#x6784;&#x5EFA;&#x955C;&#x50CF;&#x65F6;&#xFF0C;&#x4F1A;&#x83B7;&#x53D6;&#x5230;&#x6784;&#x5EFA;&#x65F6;&#x95F4;&#x6240;&#x62C9;&#x53D6;&#x4EE3;&#x7801;&#x7684;&#x6700;&#x540E;&#x4E00;&#x6B21;&#x63D0;&#x4EA4;&#x8BB0;&#x5F55;&#x4FE1;&#x606F;&#x3002;&#x53EF;&#x8FFD;&#x6EAF;&#x955C;&#x50CF;&#x4E2D;&#x4EE3;&#x7801;&#x63D0;&#x4EA4;&#x4FE1;&#x606F;&#x3002;</p>
</li>
</ul>
<h5 id="2&#x3001;&#x955C;&#x50CF;&#x63A8;&#x9001;">2&#x3001;&#x955C;&#x50CF;&#x63A8;&#x9001;</h5>
<p>&#x5728;&#x9700;&#x8981;&#x955C;&#x50CF;&#x4EA4;&#x4ED8;&#x6216;&#x76F8;&#x5173;&#x573A;&#x666F;&#x65F6;&#xFF0C;&#x53EF;&#x9009;&#x62E9;&#x955C;&#x50CF;&#x63A8;&#x9001;&#x5230;&#x76EE;&#x6807;&#x955C;&#x50CF;&#x5E93;&#x3002;</p>
<ul>
<li><p>&#x5185;&#x90E8;&#x955C;&#x50CF;&#x5E93;&#xFF1A;&#x63A8;&#x9001;&#x5230;&#x5176;&#x4ED6;&#x73AF;&#x5883;&#x7684;&#x955C;&#x50CF;&#x5E93;&#xFF0C;&#x5982;&#x679C;&#x4E24;&#x4E2A;&#x73AF;&#x5883;&#x5728;&#x540C;&#x4E00;&#x4E2A;&#x96C6;&#x7FA4;&#xFF08;&#x5373;&#x4F7F;&#x7528;&#x7684;&#x662F;&#x540C;&#x4E00;&#x4E2A;&#x955C;&#x50CF;&#x5E93;&#xFF09;&#xFF0C;&#x4E5F;&#x9700;&#x8981;&#x5728;&#x6B64;&#x955C;&#x50CF;&#x955C;&#x50CF;&#x63A8;&#x9001;&#x64CD;&#x4F5C;&#xFF0C;&#x4F46;&#x5B9E;&#x9645;&#x4E0A;&#x955C;&#x50CF;&#x5E93;&#x4E0D;&#x4F1A;&#x521B;&#x5EFA;&#x51FA;&#x65B0;&#x955C;&#x50CF;&#x3002;</p>
</li>
<li><p>&#x5916;&#x90E8;&#x955C;&#x50CF;&#x5E93;&#xFF1A;&#x63A8;&#x9001;&#x5230;&#x5176;&#x4ED6;&#x955C;&#x50CF;&#x5E93;&#xFF0C;&#x586B;&#x5199;&#x76EE;&#x6807;&#x955C;&#x50CF;&#x5E93;&#x5730;&#x5740;&#xFF0C;&#x6839;&#x636E;&#x76EE;&#x6807;&#x955C;&#x50CF;&#x5E93;&#x6743;&#x9650;&#x8981;&#x6C42;&#x914D;&#x7F6E;&#x76F8;&#x5E94;&#x4F46;&#x51ED;&#x8BC1;&#x3002;</p>
</li>
</ul>
<h5 id="3&#x3001;&#x955C;&#x50CF;&#x5220;&#x9664;">3&#x3001;&#x955C;&#x50CF;&#x5220;&#x9664;</h5>
<ul>
<li>&#x81EA;&#x52A8;&#x5220;&#x9664;&#xFF1A;&#x4E3A;&#x4E86;&#x907F;&#x514D;&#x955C;&#x50CF;&#x592A;&#x591A;&#x9020;&#x6210;&#x5B58;&#x50A8;&#x7A7A;&#x95F4;&#x6D6A;&#x8D39;&#xFF0C;&#x7CFB;&#x7EDF;&#x6709;&#x5B9A;&#x65F6;&#x4EFB;&#x52A1;&#x6BCF;&#x5929;&#x51CC;&#x6668;3&#x70B9;&#x4F1A;&#x81EA;&#x52A8;&#x8FDB;&#x884C;&#x955C;&#x50CF;&#x6E05;&#x7406;&#x3002;&#x9ED8;&#x8BA4;&#x6BCF;&#x4E2A;&#x73AF;&#x5883;&#x53EA;&#x4FDD;&#x7559;&#x6700;&#x8FD1;&#x5341;&#x4E2A;&#x955C;&#x50CF;&#x3002;</li>
<li>&#x624B;&#x52A8;&#x5220;&#x9664;&#xFF1A;&#x7528;&#x6237;&#x4EA6;&#x53EF;&#x624B;&#x52A8;&#x8FDB;&#x884C;&#x955C;&#x50CF;&#x6E05;&#x7406;&#xFF0C;&#x5220;&#x9664;&#x4E0D;&#x9700;&#x8981;&#x4F46;&#x955C;&#x50CF;&#x3002;&#xFF08;&#x8BF7;&#x4E0D;&#x8981;&#x5220;&#x9664;&#x6B63;&#x5728;&#x4F7F;&#x7528;&#x4F46;&#x955C;&#x50CF;&#xFF0C;&#x4F1A;&#x5F71;&#x54CD;&#x5BB9;&#x5668;&#x6F02;&#x79FB;&#x3001;&#x6269;&#x5BB9;&#x548C;&#x91CD;&#x542F;&#xFF09;</li>
</ul>
<p>&#x955C;&#x50CF;&#x5220;&#x9664;-&#x624B;&#x52A8;&#x5220;&#x9664;
<img src="../assets/&#x955C;&#x50CF;&#x5220;&#x9664;.gif" alt=""></p>

                                
                                </section>
                            
    </div>
    <div class="search-results">
        <div class="has-results">
            
            <h1 class="search-results-title"><span class='search-results-count'></span> results matching "<span class='search-query'></span>"</h1>
            <ul class="search-results-list"></ul>
            
        </div>
        <div class="no-results">
            
            <h1 class="search-results-title">No results matching "<span class='search-query'></span>"</h1>
            
        </div>
    </div>
</div>

                        </div>
                    </div>
                
            </div>

            
                
                <a href="project.html" class="navigation navigation-prev " aria-label="Previous page: 1.3.5 项目管理">
                    <i class="fa fa-angle-left"></i>
                </a>
                
                
                <a href="config.html" class="navigation navigation-next " aria-label="Next page: 1.3.7 发布配置">
                    <i class="fa fa-angle-right"></i>
                </a>
                
            
        
    </div>

    <script>
        var gitbook = gitbook || [];
        gitbook.push(function() {
            gitbook.page.hasChanged({"page":{"title":"1.3.6 服务管理","level":"1.3.6","depth":2,"next":{"title":"1.3.7 发布配置","level":"1.3.7","depth":2,"path":"function/config.md","ref":"function/config.md","articles":[]},"previous":{"title":"1.3.5 项目管理","level":"1.3.5","depth":2,"path":"function/project.md","ref":"function/project.md","articles":[]},"dir":"ltr"},"config":{"gitbook":"*","theme":"default","variables":{},"plugins":["livereload"],"pluginsConfig":{"livereload":{},"highlight":{},"search":{},"lunr":{"maxIndexSize":1000000,"ignoreSpecialCharacters":false},"sharing":{"facebook":true,"twitter":true,"google":false,"weibo":false,"instapaper":false,"vk":false,"all":["facebook","google","twitter","weibo","instapaper"]},"fontsettings":{"theme":"white","family":"sans","size":2},"theme-default":{"styles":{"website":"styles/website.css","pdf":"styles/pdf.css","epub":"styles/epub.css","mobi":"styles/mobi.css","ebook":"styles/ebook.css","print":"styles/print.css"},"showLevel":false}},"structure":{"langs":"LANGS.md","readme":"README.md","glossary":"GLOSSARY.md","summary":"SUMMARY.md"},"pdf":{"pageNumbers":true,"fontSize":12,"fontFamily":"Arial","paperSize":"a4","chapterMark":"pagebreak","pageBreaksBefore":"/","margin":{"right":62,"left":62,"top":56,"bottom":56}},"styles":{"website":"styles/website.css","pdf":"styles/pdf.css","epub":"styles/epub.css","mobi":"styles/mobi.css","ebook":"styles/ebook.css","print":"styles/print.css"}},"file":{"path":"function/service.md","mtime":"2019-09-23T01:42:42.179Z","type":"markdown"},"gitbook":{"version":"3.2.3","time":"2019-09-23T02:06:08.686Z"},"basePath":"..","book":{"language":""}});
        });
    </script>
</div>

        
    <script src="../gitbook/gitbook.js"></script>
    <script src="../gitbook/theme.js"></script>
    
        
        <script src="../gitbook/gitbook-plugin-livereload/plugin.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-search/search-engine.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-search/search.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-lunr/lunr.min.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-lunr/search-lunr.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-sharing/buttons.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-fontsettings/fontsettings.js"></script>
        
    

    </body>
</html>

